In [38]:
""" Phase 8 â€“ Lesson 3: Pandas (Real-World Data Handling) """

#If NumPy is the brainâ€™s math, Pandas is the memory + structure.

"""ðŸ“˜ Lesson 3: Pandas Basics (Hands-on)
Step 1: Create Notebook
"""

# Step 1: Create Notebook "03_pandas_basics.ipynb"

'ðŸ“˜ Lesson 3: Pandas Basics (Hands-on)\nStep 1: Create Notebook\n'

In [39]:
# Step 2: Import Pandas

import pandas as pd

In [40]:
#Create a Real-World Dataset (Table)

data = {
    "Name": ["Rahul", "Anjali", "Mohan"],
    "Marks": [85, 78, 92],
    "Attendance": [90, 85, 95]
}

df = pd.DataFrame(data)
df

     Name  Marks  Attendance
0   Rahul     85          90
1  Anjali     78          85
2   Mohan     92          95

In [41]:
df["Marks"]

0    85
1    78
2    92
Name: Marks, dtype: int64

In [42]:
df["Attendance"]

0    90
1    85
2    95
Name: Attendance, dtype: int64

In [43]:
df["Name"]

0     Rahul
1    Anjali
2     Mohan
Name: Name, dtype: object

In [44]:
df.loc[0]     # first student

Name          Rahul
Marks            85
Attendance       90
Name: 0, dtype: object

In [45]:
# Filtering (Very Common in AI)

df[df["Marks"] >= 80]

    Name  Marks  Attendance
0  Rahul     85          90
2  Mohan     92          95

In [46]:
df["Passed"] = df["Marks"] >= 70
df

     Name  Marks  Attendance  Passed
0   Rahul     85          90    True
1  Anjali     78          85    True
2   Mohan     92          95    True

In [47]:
df.describe()

       Marks  Attendance
count    3.0         3.0
mean    85.0        90.0
std      7.0         5.0
min     78.0        85.0
25%     81.5        87.5
50%     85.0        90.0
75%     88.5        92.5
max     92.0        95.0

In [48]:
x = df[["Marks", "Attendance"]].to_numpy()
y = df["Passed"].to_numpy()

print(x)
print(y)

[[85 90]
 [78 85]
 [92 95]]
[ True  True  True]